In [19]:
import pandas as pd
import numpy as np
import datetime as dt

# Series
A Series is a single column of data from a DataFrame. It is a single dimension of data, composed of just an index and the data.  The Series one-dimensional labeled array is capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.).

### create a series

In [24]:
ds = pd.Series(["a", 2, "foo", "bar", 9])
ds

0      a
1      2
2    foo
3    bar
4      9
dtype: object

### convert Panda series to Python list

In [25]:
ds = pd.Series(["a", 2, "foo", "bar", 9])
print (type(ds))
list = ds.to_list()
print (list)

<class 'pandas.core.series.Series'>
['a', 2, 'foo', 'bar', 9]

### operate over multiple series

In [26]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])

multiplied = ds1 * ds2
multiplied

0     2
1    12
2    30
3    56
4    90
dtype: int64

###  compare the elements of two series

In [27]:
ds1 = pd.Series([2, 4, 3, 3, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
print("Series One Larger:")
print(ds1 < ds2)

Series One Larger:
0    False
1    False
2     True
3     True
4    False
dtype: bool

### convert a dictionary to a series

In [32]:
dict = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
ds = pd.Series(dict)
print(type(ds))
ds

<class 'pandas.core.series.Series'>

a    100
b    200
c    300
d    400
e    800
dtype: int64

### convert a NumPy array to a Pandas series

In [35]:
npa = np.array([2, 4, 3, 3, 10])
print(type(npa))
ds = pd.Series(npa)
print(type(ds))
ds

<class 'numpy.ndarray'>
<class 'pandas.core.series.Series'>

0     2
1     4
2     3
3     3
4    10
dtype: int32

### change the data type of a Series

In [41]:
ds = pd.Series([100, 200, "foo", "bar", 300.12])
ds_num = pd.to_numeric(ds, errors='coerce')  #coerce errors returns NaN as opposed to errors
ds_num

0    100.00
1    200.00
2       NaN
3       NaN
4    300.12
dtype: float64

### convert the first column of a DataFrame as a Series

In [45]:
df = pd.DataFrame(
    {"A" : [1, 3, 8],
     "B" : [2, 5, 7],
     "C" : [3, 5, 9]})
ds = pd.Series(df["A"])
print(type(ds))
ds

<class 'pandas.core.series.Series'>

0    1
1    3
2    8
Name: A, dtype: int64

### convert a series to a nupy array

In [51]:
ds = pd.Series([100, 200, "foo", "bar", 300.12])
npa = np.array(ds)
print(type(npa))
print(npa)

<class 'numpy.ndarray'>
[100 200 'foo' 'bar' 300.12]

### convert series of lists to one series
pd.Series.apply will invoke function on values of series https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.apply.html

In [62]:
ds = pd.Series([["Red", "Green", "Blue"], ["Red", "Black"], "White"])
ds = ds.apply(pd.Series).stack().reset_index(drop=True)  #reset index value otherwise get 'gaps' or mult index values
print(ds)

0      Red
1    Green
2     Blue
3      Red
4    Black
5    White
dtype: object

### sort a series

In [64]:
ds = pd.Series([100, 200, 1, 5.6, 300.12])
ds_sorted = ds.sort_values()
ds_sorted

2      1.00
3      5.60
0    100.00
1    200.00
4    300.12
dtype: float64

### add data to existing series

In [73]:
ds = pd.Series([100, 200, 58, 56, 88])
ds2 = pd.Series(["foo", "bar"])
ds = ds.append(ds2).reset_index(drop=True)
ds

0    100
1    200
2     58
3     56
4     88
5    foo
6    bar
dtype: object

### create a subset of a given series based on value and condition

In [75]:
ds = pd.Series([100, 200, 58, 56, 88])
ds_less_than_100 = ds[ds < 100]
ds_less_than_100

2    58
3    56
4    88
dtype: int64

### change the order of index of a series

In [76]:
ds = pd.Series(data=["A", "C", "D", "B"], index=[4, 2, 3, 1])
print (ds)
ds_reindex = ds.reindex([1, 2, 3, 4])
ds_reindex

4    A
2    C
3    D
1    B
dtype: object

1    B
2    C
3    D
4    A
dtype: object

### create the mean and standard deviation of a Series

In [84]:
ds = pd.Series([1, 5, 7, 9, 12])
mean = ds.mean()
std_dev = ds.std()
print(f"Mean: {mean}  Std Dev: {std_dev}")

Mean: 6.8  Std Dev: 4.147288270665545

### items of a series present in another series

In [96]:
ds1 = pd.Series([1, 5, 7, 9, 12])
ds2 = pd.Series([1, 8, 7, 15, 12])

#value in other series
val_in_other_series = ds1[ds1.isin(ds2)]  
print(val_in_other_series)

0     1
2     7
4    12
dtype: int64

### items of a series NOT present in another series

In [97]:
ds1 = pd.Series([1, 5, 7, 9, 12])
ds2 = pd.Series([1, 8, 7, 15, 12])

#value not in other series
val_not_in_other_series = ds1[~ds1.isin(ds2)]  
print(val_not_in_other_series)

1    5
3    9
dtype: int64

### compute the min, 25th perc, median, 75th perc, max

In [102]:
numbers = pd.Series(np.random.normal(10, 4, 100))
result = np.percentile(numbers, q=[0, 25, 50, 75, 100])
result

array([ 1.16329638,  9.18209927, 10.91630888, 14.94066182, 24.30158889])

### frequency counts of unique values in series

In [113]:
numbers = pd.Series(np.random.randint(1, 10, 100))
results = numbers.value_counts()
results

8    14
2    14
7    13
6    13
5    11
4    11
1    10
9     8
3     6
dtype: int64

### relabel non-top values as 'other'

In [138]:
np.random.RandomState(100)
num_series = pd.Series(np.random.randint(1, 10, [100]))
result = num_series[~num_series.isin(num_series.value_counts().index[:1])] = 'Other'
num_series

0     Other
1     Other
2     Other
3     Other
4     Other
      ...
95        5
96    Other
97    Other
98    Other
99    Other
Length: 100, dtype: object

###  find the positions of numbers that are multiples of 5

In [151]:
num_series = pd.Series(np.random.randint(1, 11, 20))
results = np.argwhere(num_series % 5 == 0)
results  #can validate by printing num_series

array([[ 0],
       [ 1],
       [ 3],
       [14],
       [15],
       [19]], dtype=int64)

### extract items at given positions of a series

In [156]:
ds = pd.Series(["apple", "banana", "orange", "pineapple", "pear"])
result_1 = ds.take([2])
result_2 = ds.take([0, 1, 2])
print(result_1)
print(result_2)

2    orange
dtype: object
0     apple
1    banana
2    orange
dtype: object

### get the positions of items of a series in another series

In [159]:
ds1 = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
ds2 = pd.Series([1, 3, 5, 7, 10])

result = [pd.Index(ds1).get_loc(i) for i in ds2]
print("Positions of items of series2 in series1:")
result

Positions of items of series2 in series1:

[0, 2, 4, 6, 9]

### convert the first and last character of each word to upper case in series

In [162]:
ds = pd.Series(["bill s", "ted r", "sarah h", "adam r"])
result = ds.map(lambda x: x[0].upper() + x[1:-1] + x[-1].upper()) 
result

0     Bill S
1      Ted R
2    Sarah H
3     Adam R
dtype: object

### calculate the number of characters in each word in a series

In [207]:
ds = pd.Series(["bill", "ted", "sarah", "adam"])
result = ds.map(lambda x: len(x))
type(result)
result

0    4
1    3
2    5
3    4
dtype: int64

### compute difference between consecutive numbers of a series

In [168]:
ds = pd.Series([1, 5, 7, 9, 12])
result = ds.diff()  #.diff provies first discrete difference of element
result[1:]

1    4.0
2    2.0
3    2.0
4    3.0
dtype: float64

### convert date strings to a timeseries

In [190]:
ds = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
date_ds = pd.to_datetime(ds)
date_ds

0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

### get the day of month, year, week from date strings

In [203]:
from dateutil.parser import parse

ds = pd.Series(['01 Jan 2015', '10-02-2016', '20180307', '2014/05/06', '2016-04-12', '2019-04-06T11:20'])
ds = ds.map(lambda x: parse(x))
day_of_month = ds.dt.day.to_list()
day_of_year = ds.dt.dayofyear.to_list()
week_number = ds.dt.weekofyear.to_list()
day_of_week = ds.dt.weekday_name.to_list()
print(f"Day of month: {day_of_month}")
print(f"Day of year: {day_of_year}")
print(f"Week number: {week_number}")
print(f"Day of week: {day_of_week}")

Day of month: [1, 2, 7, 6, 12, 6]
Day of year: [1, 276, 66, 126, 103, 96]
Week number: [1, 39, 10, 19, 15, 14]
Day of week: ['Thursday', 'Sunday', 'Wednesday', 'Tuesday', 'Tuesday', 'Saturday']

### convert year-month string to year-month-day

In [211]:
from dateutil.parser import parse

ds = pd.Series(["June 2011", "July 2015", "May 2020", "January 2010"])
ds = ds.map(lambda x: parse("1" + x))
ds

0   2011-06-01
1   2015-07-01
2   2020-05-01
3   2010-01-01
dtype: datetime64[ns]

### filter words from a given series that contain condition

In [219]:
ds = pd.Series(["basketball", "tennis", "football", "baseball", "golf", "lacross", "handball"])

#words that dont contain 'ball'
result = ds[~ds.str.contains('ball')]  # ~ negates the condition
result

1     tennis
4       golf
5    lacross
dtype: object

### Euclidean distance between two series
The Euclidean distance or Euclidean metric is the "ordinary" straight-line distance between two points in Euclidean space. With this distance, Euclidean space becomes a metric space. The associated norm is called the Euclidean norm.

In [10]:
x = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
y = pd.Series([11, 8, 7, 5, 6, 5, 3, 4, 7, 1])
print("Euclidean distance between two said series:")
print(np.linalg.norm(x-y))

Euclidean distance between two said series:
16.492422502470642

### find the positions of the values neighboured by smaller values on both sides

In [12]:
ds1 = pd.Series([1, 8, 7, 5, 6, 5, 3, 4, 7, 1])
temp = np.diff(np.sign(np.diff(ds1)))
result = np.where(temp == -2)[0] + 1
print(result)

[1 4 8]

# Dataframes
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

- Dict of 1D ndarrays, lists, dicts, or Series
- 2-D numpy.ndarr oay
- Structured or record ndarray
- A Series
- Another DataFrame

Along with the data, you can optionally pass index (row labels) and columns (column labels) arguments. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

### create a dataframe from a dictionary of lists

In [13]:
df = pd.DataFrame({"item" : [1, 3, 5, 6],
                   "sales" : [200, 450, 500, 200],
                   "product" : ["foo", "bar", "foobar", "item"]
                  })
df

   item  sales product
0     1    200     foo
1     3    450     bar
2     5    500  foobar
3     6    200    item

### create dataframe with specific index values

In [14]:
data = {"item" : [1, 3, 5, 6], "sales" : [200, 450, 500, 200], "product" : ["foo", "bar", "foobar", "item"]}
labels = ["a", "b", "c", "d"]
df = pd.DataFrame(data=data, index=labels)
df

   item  sales product
a     1    200     foo
b     3    450     bar
c     5    500  foobar
d     6    200    item

### display dataframe summary information

In [17]:
data = {"item" : [1, 3, 5, 6], "sales" : [200, 450, 500, 200], "product" : ["foo", "bar", "foobar", "item"]}
labels = ["a", "b", "c", "d"]
df = pd.DataFrame(data=data, index=labels)
print(df.describe())
print(df.info())

           item       sales
count  4.000000    4.000000
mean   3.750000  337.500000
std    2.217356  160.078106
min    1.000000  200.000000
25%    2.500000  200.000000
50%    4.000000  325.000000
75%    5.250000  462.500000
max    6.000000  500.000000
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
item       4 non-null int64
sales      4 non-null int64
product    4 non-null object
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes
None

### get the first n rows of a dataframe

In [21]:
df = pd.DataFrame({"item" : [1, 3, 5, 6],
                   "sales" : [200, 450, 500, 200],
                   "product" : ["foo", "bar", "foobar", "item"]
                  })
print(df.head(2))
    # or 
print(df.iloc[:2])

   item  sales product
0     1    200     foo
1     3    450     bar
   item  sales product
0     1    200     foo
1     3    450     bar

### get specific n columns of a dataframe

In [22]:
df = pd.DataFrame({"item" : [1, 3, 5, 6],
                   "sales" : [200, 450, 500, 200],
                   "product" : ["foo", "bar", "foobar", "item"]
                  })
df[["item", "product"]]

   item product
0     1     foo
1     3     bar
2     5  foobar
3     6    item

### select the specified columns and rows of a dataframe

In [28]:
data = {"item" : [1, 3, 5, 6], "sales" : [200, 450, 500, 200], "product" : ["foo", "bar", "foobar", "item"]}
labels = ["a", "b", "c", "d"]
df = pd.DataFrame(data=data, index=labels)

# with loc (label)
print(df.loc[["a", "c"], ["item", "product"]])

# with iloc (position)
print(df.iloc[[0, 2], [0, 2]])

   item product
a     1     foo
c     5  foobar
   item product
a     1     foo
c     5  foobar

### select rows where condition is met

In [33]:
data = {"item" : [1, 3, 5, 6], "sales" : [200, 450, 500, 200], "product" : ["foo", "bar", "foobar", "item"]}
labels = ["a", "b", "c", "d"]
df = pd.DataFrame(data=data, index=labels)

df[df["sales"] > 200]

   item  sales product
b     3    450     bar
c     5    500  foobar

### count the number of rows and columns

In [41]:
data = {"item" : [1, 3, 5, 6], "sales" : [200, 450, 500, 200], "product" : ["foo", "bar", "foobar", "item"]}
labels = ["a", "b", "c", "d"]
df = pd.DataFrame(data=data, index=labels)

#axes[0] is rows, axes[1] is columns
rows_count = len(df.axes[0])  
column_count = len(df.axes[1])
print(f"Rows: {rows_count}  Columns: {column_count}")

Rows: 4  Columns: 3

### select NaN / null rows

In [7]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data=exam_data, index=labels)

df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### select rows between numeric range (single column)

In [12]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df[(df["sales"] > 250) & (df["sales"] < 500)]

   item  sales  product
b     3    450      bar
e     9    300  product

### select rows for conditions in multiple columns

In [13]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df[(df["sales"] > 250) & (df["cost"] < 300)]

   item  sales  cost  product
b     3    450   150      bar
e     9    300   250  product

### change value in specific cell (row and column)

data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df.loc["d", "sales"] = 999
df

### calculate sum of a column

In [20]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

total_sales = df["sales"].sum()
total_sales

1650

### calculate mean of a column

In [21]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

avg_sales = df["sales"].mean()
avg_sales

330.0

### add new row to dataframe

In [25]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df.loc["f"] = ["10", 999, 499, "new item"]
df

  item  sales  cost   product
a    1    200    50       foo
b    3    450   150       bar
c    5    500   300    foobar
d    6    200   150      item
e    9    300   250   product
f   10    999   499  new item

### sort a dataframe

In [30]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df.sort_values(by=["sales", "cost"], ascending=[True, True])

   item  sales  cost  product
a     1    200    50      foo
d     6    200   150     item
e     9    300   250  product
b     3    450   150      bar
c     5    500   300   foobar

### replace values in a column with a new value (.loc, .map)

In [39]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["fd", "bev", "bev", "bev", "fd"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

# map all categories using map
df["category"] = df["category"].map({"bev" : "beverage", "fd" : "food"})
print(df)

# change one value based on condition using loc
df.loc[(df["category"] == "beverage"), "category"] = "drink"
print(df)

   item  sales  cost  category
a     1    200    50      food
b     3    450   150  beverage
c     5    500   300  beverage
d     6    200   150  beverage
e     9    300   250      food
   item  sales  cost category
a     1    200    50     food
b     3    450   150    drink
c     5    500   300    drink
d     6    200   150    drink
e     9    300   250     food

### replace values in a column with a new value (.replace)

In [41]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["fd", "bev", "bev", "bev", "fd"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df["category"] = df["category"].replace("fd", "food")
df

   item  sales  cost category
a     1    200    50     food
b     3    450   150      bev
c     5    500   300      bev
d     6    200   150      bev
e     9    300   250     food

### delete column from dataframe (.drop, .pop)

In [49]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["fd", "bev", "bev", "bev", "fd"], "count" : [6, 51, 21, 19, 12]})

df.pop("category")
print(df)

#or 

df = df.drop(["cost", "count"], axis=1)
print(df)

   item  sales  cost  count
0     1    200    50      6
1     3    450   150     51
2     5    500   300     21
3     6    200   150     19
4     9    300   250     12
   item  sales
0     1    200
1     3    450
2     5    500
3     6    200
4     9    300

### insert a new column

In [53]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["fd", "bev", "bev", "bev", "fd"]})

df["count"] = [6, 51, 21, 19, 12]
df

   item  sales  cost category  count
0     1    200    50       fd      6
1     3    450   150      bev     51
2     5    500   300      bev     21
3     6    200   150      bev     19
4     9    300   250       fd     12

### iterate over rows in a dataframe
df.iterrows() Iterate over DataFrame rows as (index, Series) pairs.

In [57]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "tv"], "category" : ["fd", "bev", "bev", "bev", "fd"]})

for index, row in df.iterrows():
    print(f"{row['product']} costs: ${row['cost']}")

foo costs: $50
bar costs: $150
foobar costs: $300
item costs: $150
tv costs: $250

### get list of dataframe column headers

In [61]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "tv"], "category" : ["fd", "bev", "bev", "bev", "fd"]})

df.columns.values

array(['item', 'sales', 'cost', 'product', 'category'], dtype=object)

### rename columns of a given dataframe

In [63]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "tv"], "category" : ["fd", "bev", "bev", "bev", "fd"]})

df.columns = ['Column1', 'Column2', 'Column3', 'Column4', 'Column5']
df

   Column1  Column2  Column3 Column4 Column5
0        1      200       50     foo      fd
1        3      450      150     bar     bev
2        5      500      300  foobar     bev
3        6      200      150    item     bev
4        9      300      250      tv      fd

### rename specific column

In [73]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "tv"], "category" : ["fd", "bev", "bev", "bev", "fd"]})

df = df.rename(columns = {"category" : "retail_category"})
df

   item  sales  cost product retail_category
0     1    200    50     foo              fd
1     3    450   150     bar             bev
2     5    500   300  foobar             bev
3     6    200   150    item             bev
4     9    300   250      tv              fd

### change the order of columns

In [66]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "tv"], "category" : ["fd", "bev", "bev", "bev", "fd"]})

df[["item", "product", "category", "sales", "cost"]]

   item product category  sales  cost
0     1     foo       fd    200    50
1     3     bar      bev    450   150
2     5  foobar      bev    500   300
3     6    item      bev    200   150
4     9      tv       fd    300   250

### write to csv

In [11]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "tv"], "category" : ["fd", "bev", "bev", "bev", "fd"]})

df.to_csv("writetocsv_sample.csv", index=False)

### groupby and create counts

In [13]:
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

city_count_df = df.groupby(["city"]).count().reset_index()
city_count_df.rename(columns={"name" : "people count"}, inplace=True)
city_count_df

          city  people count
0   California             4
1      Georgia             2
2  Los Angeles             4

### delete rows based on column value

In [15]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["food", "beverage", "beverage", "food", "food"]})

df = df[df["category"] != "beverage"]
df

   item  sales  cost category
0     1    200    50     food
3     6    200   150     food
4     9    300   250     food

### widen output display to see more columns

In [16]:
# these are all options to adjust diplay of columns, rows, and width of dataframes
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

### select a row by index

In [30]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["food", "beverage", "beverage", "food", "food"]})

df.iloc[[2], :]

   item  sales  cost  category
2     5    500   300  beverage

### replace NaN values with Zero

In [29]:
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']})

df = df.fillna(0)
df.head()

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no

### convert index in a column of a dataframe

In [32]:
data = {"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "product" : ["foo", "bar", "foobar", "item", "product"]}
labels = ["a", "b", "c", "d", "e"]
df = pd.DataFrame(data=data, index=labels)

df.reset_index(level=0, inplace=True)
df

  index  item  sales  cost  product
0     a     1    200    50      foo
1     b     3    450   150      bar
2     c     5    500   300   foobar
3     d     6    200   150     item
4     e     9    300   250  product

### set a given value for particular cell (.at)

In [35]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["food", "beverage", "beverage", "food", "food"]})

df.at[3, "sales"] = 999
df

   item  sales  cost  category
0     1    200    50      food
1     3    450   150  beverage
2     5    500   300  beverage
3     6    999   150      food
4     9    300   250      food

### drop a list of rows (.drop)

In [44]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["food", "beverage", "beverage", "food", "food"]})

df = df.drop(df.index[[0,2]])
df

   item  sales  cost  category
1     3    450   150  beverage
3     6    200   150      food
4     9    300   250      food

### get ratio of a dataframe (.sample)

In [53]:
df = pd.DataFrame(np.random.randn(10, 2))
df.columns = ["Set_1", "Set_2"]

part_70 = df.sample(frac=0.7, random_state=10)
part_30 = df.drop(part_70.index)

part_70

      Set_1     Set_2
8  1.165747 -0.604693
2 -1.471772  1.031580
5  1.316257 -0.500638
6  0.537055  0.135135
3 -0.980665  0.197434
1 -0.303258 -2.890178
0  0.761975  0.533917

### combining two series into a dataframe

In [59]:
ds = pd.Series([100, 200, 58, 56, 88], name="cost")
ds2 = pd.Series(["foo", "bar", "item", "product", "thing"], name="title")

df = pd.concat([ds, ds2], axis=1)
df

   cost    title
0   100      foo
1   200      bar
2    58     item
3    56  product
4    88    thing

### shuffle rows of dataframe

In [62]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["food", "beverage", "beverage", "food", "food"]})

df = df.sample(frac=1)
df

   item  sales  cost  category
4     9    300   250      food
2     5    500   300  beverage
1     3    450   150  beverage
3     6    200   150      food
0     1    200    50      food

### convert column to datetime

In [72]:
df = pd.DataFrame({"date" : ['3/11/20', '3/12/2000', 'Mar 13, 2008'], "sales" : [200, 450, 500]})
print(df)

df["date"] = pd.to_datetime(df["date"])
df

           date  sales
0       3/11/20    200
1     3/12/2000    450
2  Mar 13, 2008    500

        date  sales
0 2020-03-11    200
1 2000-03-12    450
2 2008-03-13    500

### get a list of a specified column

In [74]:
df = pd.DataFrame({"item" : [1, 3, 5, 6, 9], "sales" : [200, 450, 500, 200, 300], "cost" : [50, 150, 300, 150, 250],
        "category" : ["food", "beverage", "beverage", "food", "food"]})

sales_list = df["sales"].to_list()
print(sales_list)

[200, 450, 500, 200, 300]

### get a numpy array of a specific column